tests/Artillery/ReadEnv/read_env.yml
# Locally:
# artillery run tests/Artillery/ReadEnv/read_env.yml
# Debug> DEBUG=http* artillery run tests/Artillery/ReadEnv/read_env.yml
config:
  target: "{{APP_URL}}/api"
  phases:
    - duration: 1
      arrivalRate: 1
  processor: "./functions.js"
scenarios:
  - flow:
      - get:
          url: "/files"
          beforeRequest: "prepareEnvs"